//====================================================================================================
//
// アイコン処理 (SelectIcon.h)
// Author (Kimura kouta)
//
//====================================================================================================
#ifndef _SELECTICON_H_
#define _SELECTICON_H_

//====================================================================================================
//インクリードファイル
//====================================================================================================
#include"main.h"
#include"billboard.h"

#define MAX_TEXMAKER (2)	//読み込むテクスチャファイル名

class CPlayerBase;
//================================================================
// レンダリングクラス
//================================================================
class CSelectIcon: public CBillboard
{
public:

	//=============================================================================
	// 構造体定義
	//=============================================================================
	typedef enum
	{
		ICON_1P = 0,
		ICON_2P,
		ICON_3P,
		ICON_4P,
		ICON_MAX,
	} ICON;
	//================================================================
	// プロトタイプ宣言
	//================================================================
	CSelectIcon(OBJTYPE type);
	~CSelectIcon();

	HRESULT Init(D3DXVECTOR3 pos, ICON Icon);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CSelectIcon *Create(D3DXVECTOR3 pos, ICON Icon);
	static HRESULT Load(void);
	static void Unload(void);



private:

	static LPDIRECT3DTEXTURE9 m_pTextureIcon[MAX_TEXMAKER];

	D3DXVECTOR3 m_move;
	ICON m_Icon[4];
	float Size;
	int m_nLife;
};

//====================================================================================================
// マクロ定義
//==================================================================================================== 
#endif
