//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : KOTA KIMURA
//
//=============================================================================
#ifndef _PLAYER_KANGAROO_H_
#define _PLAYER_KANGAROO_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "Scene3D.h"
#include "playerbase.h"

//=============================================================================
// 構造体定義
//=============================================================================

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_PLAYER	(2)


//================================================================
// レンダリングクラス
//================================================================
class CPlayer_Kangaroo : public CPlayerBase
{
public:

	//=============================================================================
	// プロトタイプ宣言
	//=============================================================================
	CPlayer_Kangaroo(OBJTYPE type);
	~CPlayer_Kangaroo();

	static CPlayer_Kangaroo *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, PLAYERNUM PlayerNum);

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, PLAYERNUM PlayerNum);

	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};
#endif
