//====================================================================================================
//
// 背景処理 (SelectionScreen.cpp)
// Author  Kimura Kouta
//
//====================================================================================================
#ifndef _SELECTIONSCREEN_H_
#define _SELECTIONSCREEN_H_

//====================================================================================================
//インクリードファイル
//====================================================================================================
#include"main.h"
#include"manager.h"
#include"SelectIcon.h"
#include "Texture.h"


//====================================================================================================
// プロトタイプ宣言
//=====================================================================================================

//================================================================
// レンダリングクラス
//================================================================
class CSelectionScreen
{
public:

	// プロトタイプ宣言
	CSelectionScreen();
	~CSelectionScreen();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CSelectionScreen * Create();

private:

	CSelectIcon *m_pPlayerIcon[2];
	CTexture *m_pTexture[2] = {};

	CTexture *m_pTextureIcon[3];

	CTexture *m_Ready;
};
#endif